
[
  {
    "title": "Champagne Mushroom Risotto",
    "ingredients": "3 tb Butter or margarine|1 c Converted rice|2/3 c Onion; chopped|1 3/4 c Water|3/4 c Champagne or dry white wine|1 cn Cream of mushroom soup|1/4 ts Fresh ground pepper|1/8 ts Ground nutmeg|1/8 ts Ground red pepper(optional)|1 c Red bell pepper; julienne|Fresh parsley; finely chop|Parmesan cheese (optional)",
    "servings": "6 Servings",
    "instructions": "Melt butter in medium saucepan. Add rice and onion. Cook over medium heat, stirring frequently, 3-4 minutes or until onion is tender. Add water and champagne. Bring to a boil. Reduce heat, cover and simmer 20 minutes. Stir in cream of mushroom soup, pepper, nutmeg, and, if desired, ground red pepper. Cook and stir 5 minutes, or until creamy and heated through. Stir in red bell pepper and parsley. Sprinkle with cheese, if desired."
  },
  {
    "title": "Red Wine and Mushroom Risotto",
    "ingredients": "1 oz Porcini mushrooms; dried|2 c Boiling water|1 1/2 lb Mushrooms; cremini or white|6 tb Unsalted butter|5 1/2 c Chicken broth|6 oz Pancetta; 1/4 inch thick|1 c Onion; chopped fine|1 tb Fresh rosemary; chopped fine|1 tb Fresh sage; chopped fine|3 c Arborio rice|2 c Dry red wine; * see note|3 tb Fresh parsley; chopped fine|1 c Parmesan cheese; freshly|Grated|Garnishes|Parmesan curls|Fresh rosemary sprigs",
    "servings": "6 Servings",
    "instructions": "In a small bowl, soak porcini in boiling water 30 minutes. Pour soaking liq through a fine sieve lined with a dampened paper towel or coffee filter int bowl and reserve. Wash porcini under cold water to remove any grit and pat Chop porcini fine. Chop fine 1/4 pound cremini or white mushrooms (about 1-1/2 cuos) and reser Depending on size, halve and/or quarter remaining 1-1/4 pounds cremini or w mushrooms, and in a large heavy skillet cook in 4 tablespoons butter with s and pepper to taste over moderate heat, stirring, until tender, 5 to 10 min Remove skillet from heat and reserve mushrooms in skillet. (They will be re just before serving.) On a large sauce pan heat broth and keep at a bare simmer. In a 5- to 6-quart heavy saucepan, cook pancetta over moderate heat, stirri minutes. Add reserved finely chopped cremini or white mushrooms, remaining tablespoons butter, onion, rosemary, sage, and salt and pepper to taste and stirring until onion is softened. Stir in rice and cook, stirring, until co well with fat, about 1 minute. Add 1 cuop wine and cook, stirring constantl until absorbed. Add remaining cup wine and cook, stirring constantly, until absorbed. Add 1 cup simmering broth and cook, stirring constantly, until absorbed. Co cooking and adding broth, 1/2 cup at a time, stirring constantly and lettin each addition be absorbed before adding next, until rice is tender and creamy-looking but still al dente, 20 to 25 minutes. About half way through cooking, add reserved porcini soaking liquid and cho porcini, stirring constantly until liquid is absorbed, and continue cooking adding broth in same manner. During last few minutes of cooking, reheat reserved cremini or white mushro skillet over moderate heat, stirring, until hot, and stir in parsley and sa pepper to taste. Stir grated Parmesan and salt and pepper to taste into ris Serve risotto immediately, topped with cremini or white mushrooms and garni with Parmesan curls and rosemary sprigs. Serves 6."
  }
]